# StairsSupportHorizontalOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupportHorizontalOffset Property
ParameterTypeId Class See Also
---
"Lateral Offset": Distance from center or edge of boundary
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupportHorizontalOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupportHorizontalOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupportHorizontalOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace